```
Terraform will perform the following actions:

  # module.jenkins.aws_iam_instance_profile.jenkins must be replaced
-/+ resource "aws_iam_instance_profile" "jenkins" {
      ~ arn         = "arn:aws:iam::587807691409:instance-profile/jenkins_profile-ci-sandbox" -> (known after apply)
      ~ create_date = "2020-12-11T14:35:25Z" -> (known after apply)
      ~ id          = "jenkins_profile-ci-sandbox" -> (known after apply)
      ~ name        = "jenkins_profile-ci-sandbox" -> "jenkins_profile-sandbox" # forces replacement
        path        = "/"
      ~ role        = "jenkins_dynamic_inventory_role-ci-sandbox" -> "jenkins_dynamic_inventory_role-sandbox"
      ~ roles       = [
          - "jenkins_dynamic_inventory_role-ci-sandbox",
        ] -> (known after apply)
      ~ unique_id   = "AIPAYRXARSKIZGB53UUP6" -> (known after apply)
    }

  # module.jenkins.aws_iam_role.jenkins must be replaced
-/+ resource "aws_iam_role" "jenkins" {
      ~ arn                   = "arn:aws:iam::587807691409:role/jenkins_dynamic_inventory_role-ci-sandbox" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "ec2.amazonaws.com"
                        }
                        Sid       = "JenkinsDynamicInventoryAssumeRole"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2020-12-11T14:35:24Z" -> (known after apply)
        force_detach_policies = false
      ~ id                    = "jenkins_dynamic_inventory_role-ci-sandbox" -> (known after apply)
        max_session_duration  = 3600
      ~ name                  = "jenkins_dynamic_inventory_role-ci-sandbox" -> "jenkins_dynamic_inventory_role-sandbox" # forces replacement
        path                  = "/"
      - tags                  = {} -> null
      ~ unique_id             = "AROAYRXARSKI5JM6KGMBP" -> (known after apply)
    }

  # module.jenkins.aws_iam_role_policy.jenkins must be replaced
-/+ resource "aws_iam_role_policy" "jenkins" {
      ~ id     = "jenkins_dynamic_inventory_role-ci-sandbox:jenkins_dynamic_inventory_policy-ci-sandbox" -> (known after apply)
      ~ name   = "jenkins_dynamic_inventory_policy-ci-sandbox" -> "jenkins_dynamic_inventory_policy" # forces replacement
        policy = jsonencode(
            {
                Statement = [
                    {
                        Action   = [
                            "ec2:Describe*",
                            "rds:Describe*",
                            "route53:ListHostedZones",
                            "route53:ListResourceRecordSets",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ role   = "jenkins_dynamic_inventory_role-ci-sandbox" -> (known after apply) # forces replacement
    }

  # module.jenkins.aws_security_group_rule.ansible will be created
  + resource "aws_security_group_rule" "ansible" {
      + description              = "Allow Ansible access from Jenkins to VPC resources."
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0599014293c0c3234"
      + self                     = false
      + source_security_group_id = "sg-0b157bbfc1ef7cea1"
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.jenkins_saml.aws_acm_certificate.lb will be destroyed
  - resource "aws_acm_certificate" "lb" {
      - arn                       = "arn:aws:acm:us-east-1:587807691409:certificate/127c4786-2a99-4962-897b-5cc86df14a71" -> null
      - domain_name               = "jenkins-saml.sandbox.datagov.us" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "jenkins-saml.sandbox.datagov.us"
              - resource_record_name  = "_9d1755f7fc21eeea0123b4cc225955cb.jenkins-saml.sandbox.datagov.us."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_4dbbb74c8d84423928ab14b6ffd38aee.rlltrpyzyf.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:587807691409:certificate/127c4786-2a99-4962-897b-5cc86df14a71" -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [] -> null
      - tags                      = {
          - "env" = "sandbox"
        } -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.jenkins_saml.aws_acm_certificate_validation.lb will be destroyed
  - resource "aws_acm_certificate_validation" "lb" {
      - certificate_arn         = "arn:aws:acm:us-east-1:587807691409:certificate/127c4786-2a99-4962-897b-5cc86df14a71" -> null
      - id                      = "2020-12-11 14:35:45 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_9d1755f7fc21eeea0123b4cc225955cb.jenkins-saml.sandbox.datagov.us",
        ] -> null
    }

  # module.jenkins_saml.aws_iam_instance_profile.jenkins will be destroyed
  - resource "aws_iam_instance_profile" "jenkins" {
      - arn         = "arn:aws:iam::587807691409:instance-profile/jenkins_profile-jenkins-saml-sandbox" -> null
      - create_date = "2020-12-11T14:35:24Z" -> null
      - id          = "jenkins_profile-jenkins-saml-sandbox" -> null
      - name        = "jenkins_profile-jenkins-saml-sandbox" -> null
      - path        = "/" -> null
      - role        = "jenkins_dynamic_inventory_role-jenkins-saml-sandbox" -> null
      - roles       = [
          - "jenkins_dynamic_inventory_role-jenkins-saml-sandbox",
        ] -> null
      - unique_id   = "AIPAYRXARSKI4Z3NES5ST" -> null
    }

  # module.jenkins_saml.aws_iam_role.jenkins will be destroyed
  - resource "aws_iam_role" "jenkins" {
      - arn                   = "arn:aws:iam::587807691409:role/jenkins_dynamic_inventory_role-jenkins-saml-sandbox" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = "JenkinsDynamicInventoryAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2020-12-11T14:35:24Z" -> null
      - force_detach_policies = false -> null
      - id                    = "jenkins_dynamic_inventory_role-jenkins-saml-sandbox" -> null
      - max_session_duration  = 3600 -> null
      - name                  = "jenkins_dynamic_inventory_role-jenkins-saml-sandbox" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - unique_id             = "AROAYRXARSKI3BLF6QF7L" -> null
    }

  # module.jenkins_saml.aws_iam_role_policy.jenkins will be destroyed
  - resource "aws_iam_role_policy" "jenkins" {
      - id     = "jenkins_dynamic_inventory_role-jenkins-saml-sandbox:jenkins_dynamic_inventory_policy-jenkins-saml-sandbox" -> null
      - name   = "jenkins_dynamic_inventory_policy-jenkins-saml-sandbox" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:Describe*",
                          - "rds:Describe*",
                          - "route53:ListHostedZones",
                          - "route53:ListResourceRecordSets",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "jenkins_dynamic_inventory_role-jenkins-saml-sandbox" -> null
    }

  # module.jenkins_saml.aws_lb_target_group_attachment.lb will be destroyed
  - resource "aws_lb_target_group_attachment" "lb" {
      - id               = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/jenkins-saml-sandbox/1aa8b498f85fd96f-20201211143819929600000002" -> null
      - target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/jenkins-saml-sandbox/1aa8b498f85fd96f" -> null
      - target_id        = "i-0098ba7e03c64d1e3" -> null
    }

  # module.jenkins_saml.aws_route53_record.lb will be destroyed
  - resource "aws_route53_record" "lb" {
      - fqdn    = "jenkins-saml.sandbox.datagov.us" -> null
      - id      = "Z05804831W9PRQ2GEV3V1_jenkins-saml_CNAME" -> null
      - name    = "jenkins-saml" -> null
      - records = [
          - "jenkins-saml-sandbox-tf-488675609.us-east-1.elb.amazonaws.com",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z05804831W9PRQ2GEV3V1" -> null
    }

  # module.jenkins_saml.aws_route53_record.lb_cert_validation will be destroyed
  - resource "aws_route53_record" "lb_cert_validation" {
      - fqdn    = "_9d1755f7fc21eeea0123b4cc225955cb.jenkins-saml.sandbox.datagov.us" -> null
      - id      = "Z05804831W9PRQ2GEV3V1__9d1755f7fc21eeea0123b4cc225955cb.jenkins-saml.sandbox.datagov.us._CNAME" -> null
      - name    = "_9d1755f7fc21eeea0123b4cc225955cb.jenkins-saml.sandbox.datagov.us" -> null
      - records = [
          - "_4dbbb74c8d84423928ab14b6ffd38aee.rlltrpyzyf.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z05804831W9PRQ2GEV3V1" -> null
    }

  # module.jenkins_saml.aws_security_group.default will be destroyed
  - resource "aws_security_group" "default" {
      - arn                    = "arn:aws:ec2:us-east-1:587807691409:security-group/sg-07b10d8a26557c41b" -> null
      - description            = "Jenkins security group" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/8",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ] -> null
      - id                     = "sg-07b10d8a26557c41b" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0d62b0af2e0e59f66",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0d62b0af2e0e59f66",
                ]
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "jenkins-jenkins-saml-sandbox-tf" -> null
      - owner_id               = "587807691409" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "env" = "sandbox"
        } -> null
      - vpc_id                 = "vpc-0e4d22d8b2666bf6f" -> null
    }

  # module.jenkins_saml.aws_security_group.lb will be destroyed
  - resource "aws_security_group" "lb" {
      - arn                    = "arn:aws:ec2:us-east-1:587807691409:security-group/sg-0d62b0af2e0e59f66" -> null
      - description            = "Load balancer security group for jenkins-saml-sandbox" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.0.1.0/24",
                  - "10.0.2.0/24",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "10.0.1.0/24",
                  - "10.0.2.0/24",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - id                     = "sg-0d62b0af2e0e59f66" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "jenkins-saml-sandbox-lb-sg-tf" -> null
      - owner_id               = "587807691409" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - vpc_id                 = "vpc-0e4d22d8b2666bf6f" -> null
    }

  # module.jenkins_saml.aws_security_group_rule.ansible will be destroyed
  - resource "aws_security_group_rule" "ansible" {
      - cidr_blocks              = [] -> null
      - description              = "Allow Ansible access from Jenkins to VPC resources." -> null
      - from_port                = 22 -> null
      - id                       = "sgrule-3362884906" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0599014293c0c3234" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-07b10d8a26557c41b" -> null
      - to_port                  = 22 -> null
      - type                     = "ingress" -> null
    }

  # module.jenkins_saml.module.jenkins.aws_ebs_volume.default[0] will be destroyed
  - resource "aws_ebs_volume" "default" {
      - arn                  = "arn:aws:ec2:us-east-1:587807691409:volume/vol-0defdb78ca1cabb72" -> null
      - availability_zone    = "us-east-1a" -> null
      - encrypted            = false -> null
      - id                   = "vol-0defdb78ca1cabb72" -> null
      - iops                 = 100 -> null
      - multi_attach_enabled = false -> null
      - size                 = 8 -> null
      - tags                 = {
          - "env" = "sandbox"
        } -> null
      - type                 = "gp2" -> null
    }

  # module.jenkins_saml.module.jenkins.aws_instance.default[0] will be destroyed
  - resource "aws_instance" "default" {
      - ami                          = "ami-053adf54573f777cf" -> null
      - arn                          = "arn:aws:ec2:us-east-1:587807691409:instance/i-0098ba7e03c64d1e3" -> null
      - associate_public_ip_address  = false -> null
      - availability_zone            = "us-east-1a" -> null
      - cpu_core_count               = 2 -> null
      - cpu_threads_per_core         = 1 -> null
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - get_password_data            = false -> null
      - hibernation                  = false -> null
      - iam_instance_profile         = "jenkins_profile-jenkins-saml-sandbox" -> null
      - id                           = "i-0098ba7e03c64d1e3" -> null
      - instance_state               = "running" -> null
      - instance_type                = "t2.medium" -> null
      - ipv6_address_count           = 0 -> null
      - ipv6_addresses               = [] -> null
      - key_name                     = "datagov-sandbox" -> null
      - monitoring                   = false -> null
      - primary_network_interface_id = "eni-0400111939cfbd88e" -> null
      - private_dns                  = "ip-10-0-1-142.ec2.internal" -> null
      - private_ip                   = "10.0.1.142" -> null
      - security_groups              = [] -> null
      - source_dest_check            = true -> null
      - subnet_id                    = "subnet-0bbe8705ad1ce9a08" -> null
      - tags                         = {
          - "Name"  = "jenkins-saml1tf"
          - "env"   = "sandbox"
          - "group" = "jenkins"
        } -> null
      - tenancy                      = "default" -> null
      - volume_tags                  = {
          - "env" = "sandbox"
        } -> null
      - vpc_security_group_ids       = [
          - "sg-0599014293c0c3234",
          - "sg-07b10d8a26557c41b",
        ] -> null

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/xvdh" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - volume_id             = "vol-0defdb78ca1cabb72" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - volume_id             = "vol-0024d793fbd9ee6c2" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.jenkins_saml.module.jenkins.aws_route53_record.default[0] will be destroyed
  - resource "aws_route53_record" "default" {
      - fqdn    = "jenkins-saml1tf.internal.sandbox.datagov.us" -> null
      - id      = "Z1006361VZ0GA3BRODCA_jenkins-saml1tf_CNAME" -> null
      - name    = "jenkins-saml1tf" -> null
      - records = [
          - "ip-10-0-1-142.ec2.internal",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z1006361VZ0GA3BRODCA" -> null
    }

  # module.jenkins_saml.module.jenkins.aws_volume_attachment.default[0] will be destroyed
  - resource "aws_volume_attachment" "default" {
      - device_name  = "/dev/xvdh" -> null
      - id           = "vai-1181299143" -> null
      - instance_id  = "i-0098ba7e03c64d1e3" -> null
      - skip_destroy = true -> null
      - volume_id    = "vol-0defdb78ca1cabb72" -> null
    }

  # module.jenkins_saml.module.jenkins.null_resource.default[0] will be destroyed
  - resource "null_resource" "default" {
      - id       = "1090738504738295456" -> null
      - triggers = {
          - "attachment_ids" = "vai-1181299143"
        } -> null
    }

  # module.jenkins_saml.module.lb.aws_lb.this[0] will be destroyed
  - resource "aws_lb" "this" {
      - arn                        = "arn:aws:elasticloadbalancing:us-east-1:587807691409:loadbalancer/app/jenkins-saml-sandbox-tf/d1d87fd3143c37d6" -> null
      - arn_suffix                 = "app/jenkins-saml-sandbox-tf/d1d87fd3143c37d6" -> null
      - dns_name                   = "jenkins-saml-sandbox-tf-488675609.us-east-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields = false -> null
      - enable_deletion_protection = false -> null
      - enable_http2               = true -> null
      - id                         = "arn:aws:elasticloadbalancing:us-east-1:587807691409:loadbalancer/app/jenkins-saml-sandbox-tf/d1d87fd3143c37d6" -> null
      - idle_timeout               = 60 -> null
      - internal                   = false -> null
      - ip_address_type            = "ipv4" -> null
      - load_balancer_type         = "application" -> null
      - name                       = "jenkins-saml-sandbox-tf" -> null
      - security_groups            = [
          - "sg-0d62b0af2e0e59f66",
        ] -> null
      - subnets                    = [
          - "subnet-03ad95501c749e10a",
          - "subnet-0851c49a6d7007b74",
        ] -> null
      - tags                       = {
          - "Environment" = "sandbox"
          - "Name"        = "jenkins-saml-sandbox-tf"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                     = "vpc-0e4d22d8b2666bf6f" -> null
      - zone_id                    = "Z35SXDOTRQ7X7K" -> null

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-03ad95501c749e10a" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0851c49a6d7007b74" -> null
        }

      - timeouts {
          - create = "10m" -> null
          - delete = "10m" -> null
          - update = "10m" -> null
        }
    }

  # module.jenkins_saml.module.lb.aws_lb_listener.frontend_http_tcp[0] will be destroyed
  - resource "aws_lb_listener" "frontend_http_tcp" {
      - arn               = "arn:aws:elasticloadbalancing:us-east-1:587807691409:listener/app/jenkins-saml-sandbox-tf/d1d87fd3143c37d6/ac7900c3d0f97728" -> null
      - id                = "arn:aws:elasticloadbalancing:us-east-1:587807691409:listener/app/jenkins-saml-sandbox-tf/d1d87fd3143c37d6/ac7900c3d0f97728" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:loadbalancer/app/jenkins-saml-sandbox-tf/d1d87fd3143c37d6" -> null
      - port              = 80 -> null
      - protocol          = "HTTP" -> null

      - default_action {
          - order = 1 -> null
          - type  = "redirect" -> null

          - redirect {
              - host        = "#{host}" -> null
              - path        = "/#{path}" -> null
              - port        = "443" -> null
              - protocol    = "HTTPS" -> null
              - query       = "#{query}" -> null
              - status_code = "HTTP_301" -> null
            }
        }
    }

  # module.jenkins_saml.module.lb.aws_lb_listener.frontend_https[0] will be destroyed
  - resource "aws_lb_listener" "frontend_https" {
      - arn               = "arn:aws:elasticloadbalancing:us-east-1:587807691409:listener/app/jenkins-saml-sandbox-tf/d1d87fd3143c37d6/4c12c09caa334cce" -> null
      - certificate_arn   = "arn:aws:acm:us-east-1:587807691409:certificate/127c4786-2a99-4962-897b-5cc86df14a71" -> null
      - id                = "arn:aws:elasticloadbalancing:us-east-1:587807691409:listener/app/jenkins-saml-sandbox-tf/d1d87fd3143c37d6/4c12c09caa334cce" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:loadbalancer/app/jenkins-saml-sandbox-tf/d1d87fd3143c37d6" -> null
      - port              = 443 -> null
      - protocol          = "HTTPS" -> null
      - ssl_policy        = "ELBSecurityPolicy-2016-08" -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/jenkins-saml-sandbox/1aa8b498f85fd96f" -> null
          - type             = "forward" -> null
        }
    }

  # module.jenkins_saml.module.lb.aws_lb_target_group.main[0] will be destroyed
  - resource "aws_lb_target_group" "main" {
      - arn                                = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/jenkins-saml-sandbox/1aa8b498f85fd96f" -> null
      - arn_suffix                         = "targetgroup/jenkins-saml-sandbox/1aa8b498f85fd96f" -> null
      - deregistration_delay               = 300 -> null
      - id                                 = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/jenkins-saml-sandbox/1aa8b498f85fd96f" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - name                               = "jenkins-saml-sandbox" -> null
      - port                               = 443 -> null
      - protocol                           = "HTTPS" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {
          - "Environment" = "sandbox"
          - "Name"        = "jenkins-saml-sandbox"
          - "Terraform"   = "true"
        } -> null
      - target_type                        = "instance" -> null
      - vpc_id                             = "vpc-0e4d22d8b2666bf6f" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 5 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTPS" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }
    }

Plan: 4 to add, 0 to change, 23 to destroy.
```